\section{SPARQL - zastosowanie}
\label{cha:wykorzystanie}

Poniżej zamieszczone są przykładowe zapytania sparql do pobierania informacji z grafów przedstawionych na rysunku 1 i rysunku 2.

Jako, że platforma opiera się o scentralizowanej bazie danych udostępnionej przez protokół HTTP - aplikacje klienckie aby komunikować się z bazą muszę wykorzystywać zapytania SPARQL. Dlatego poniżej zamieszczamy przykłady możliwych zapytań. Przez to chcemy pokazać jak łatwa jest rozbudowa istniejącej aplikacji klienckiej, lub dorobienie nowych klientów (wykorzystujących inne przypadki użycia).

\subsubsection{Wyszukiwanie węzłów-rodzeństw (poprzez użycie \quotedblbase relacji sameAs\textquotedblright }

Zapytanie:
\begin{lstlisting}
PREFIX rdf:     <http://www.w3.org/ 1999/02/22-rdf-syntax-ns#> 
PREFIX rdfs:    <http://www.w3.org/ 2000/01/rdf-schema#>
PREFIX owl:     <http://www.w3.org/ 2002/07/owl#>
PREFIX HL7: <http://sim.ontology/HL7#>
SELECT ?subject ?object
	WHERE { ?subject owl:sameAs ?object }
\end{lstlisting}

Wynik:
\begin{lstlisting}
{
  "head": {
    "vars": [ "subject" , "object" ]
  } ,
  "results": {
    "bindings": [
      {
        "subject": { "type": "uri" , "value": "http://sim.ontology/ HL7#Krakow" } ,
        "object": { "type": "uri" , "value": "http://sim.ontology/ HL7#Warszawa" }
      } ,
      {
        "subject": { "type": "uri" , "value": "http://sim.ontology/ HL7#Marek_Kendziorek" } ,
        "object": { "type": "uri" , "value": "http://sim.ontology/ HL7#Wojciech_Inglot" }
      } ,
      {
        "subject": { "type": "uri" , "value": "http://sim.ontology/ HL7#Patryk_Bak" } ,
        "object": { "type": "uri" , "value": "http://sim.ontology/ HL7#Wojciech_Inglot" }
      } ,
      {
        "subject": { "type": "uri" , "value": "http://sim.ontology/ HL7#Mazowsze" } ,
        "object": { "type": "uri" , "value": "http://sim.ontology/ HL7#Malopolska" }
      } ,
      {
        "subject": { "type": "uri" , "value": "http://sim.ontology/ HL7#Mazowsze" } ,
        "object": { "type": "uri" , "value": "http://sim.ontology/ HL7#Podkarpacie" }
      } ,
      {
        "subject": { "type": "uri" , "value": "http://sim.ontology/ HL7#Malopolska" } ,
        "object": { "type": "uri" , "value": "http://sim.ontology/ HL7#Podkarpacie" }
      }
    ]
  }
}

\end{lstlisting}







\subsubsection{Wyszukiwanie miast (węzły typu hl7:EntityCity) podrzędnych do węzła \quotedblbase Polska\textquotedblright, relacja: \quotedblbase isPartOf\textquotedblright }

Zapytanie:
\begin{lstlisting}
PREFIX rdf: <http://www.w3.org/ 1999/02/22-rdf-syntax-ns#>
PREFIX owl: <http://www.w3.org/ 2002/07/owl#>
PREFIX xsd: <http://www.w3.org/ 2001/XMLSchema#>
PREFIX rdfs: <http://www.w3.org/ 2000/01/rdf-schema#>
PREFIX hl7: <http://sim.ontology/HL7#>
SELECT ?subject
	WHERE {      
		?subject rdf:type hl7:EntityCity .
		?subject hl7:isPartOf hl7:Polska
	}
\end{lstlisting}

Wynik:
\begin{lstlisting}
{
  "head": {
    "vars": [ "subject" ]
  } ,
  "results": {
    "bindings": [
      {
        "subject": { "type": "uri" , "value": "http://sim.ontology/ HL7#Krakow" }
      } ,
      {
        "subject": { "type": "uri" , "value": "http://sim.ontology/ HL7#Warszawa" }
      }
    ]
  }
}


\end{lstlisting}

\subsubsection{Wyszukiwanie miasta w którym mieszka dana osoba}

Zapytanie:
\begin{lstlisting}
PREFIX rdf: <http://www.w3.org/ 1999/02/22-rdf-syntax-ns#>
PREFIX owl: <http://www.w3.org/ 2002/07/owl#>
PREFIX xsd: <http://www.w3.org/ 2001/XMLSchema#>
PREFIX rdfs: <http://www.w3.org/ 2000/01/rdf-schema#>
PREFIX hl7: <http://sim.ontology/HL7#>
SELECT ?city ?country
	WHERE {
		hl7:Wojciech_Inglot hl7:livesIn ?city .
		?city hl7:isPartOf ?region .
		?region hl7:isPartOf ?country
	           }
\end{lstlisting}

Wynik:
\begin{lstlisting}
{
  "head": {
    "vars": [ "city" , "country" ]
  } ,
  "results": {
    "bindings": [
      {
        "city": { "type": "uri" , "value": "http://sim.ontology/ HL7#Krakow" } ,
        "country": { "type": "uri" , "value": "http://sim.ontology/ HL7#Polska" }
      }
    ]
  }
}
\end{lstlisting}

